snlkuharlocal/src/Documents/Отчет/Отчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Отчет</name>
  <attributes>
    <name>ВидОтчета</name>
    <type>
      <types>CatalogRef.ВидыОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ПериодичностьОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОтчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СНачалаГода</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланФакт</name>
    <type>
      <types>EnumRef.ПланФакт</types>
    </type>
  </attributes>
  <attributes>
    <name>Консолидированный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вариант</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВывода</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетФормулПоПодразделению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВводОстатков</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетФормулПоПериодам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата1</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>РазделОтчета</name>
      <type>
        <types>CatalogRef.АналитикаОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расшифровка1</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расшифровка2</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регистр</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расшифровка3</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Привязка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗнакПривязки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбщийИтог</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ПланФакт/ПланФакт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПланФакт</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Факт</name>
  </enumValues>
  <enumValues>
    <name>ПланКорректировка</name>
  </enumValues>
  <enumValues>
    <name>БизнесПлан</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Catalogs/ПоказателиОтчетов/ПоказателиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиОтчетов</name>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>Знак</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПоляКомпоновки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Доступность_ПланФакт</name>
    <attributes>
      <name>ПланФакт</name>
      <type>
        <types>EnumRef.ПланФакт</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Catalogs/АналитикаОтчетов/АналитикаОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>АналитикаОтчетов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ВидыОтчетов</owners>
  <attributes>
    <name>Знак</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчета</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиОтчета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расчетная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Привязка</name>
    <comment>&quot;+&quot; - привязка только на приход,&quot;-&quot; - только на расход, пусто - без разницы</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗнакOLAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаOLAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Привязки</name>
    <attributes>
      <name>ИмяРегистра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фильтр</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>Расшифровка1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Расшифровка2</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидИтога</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_Привязки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстПостроителя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Знак</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРасшифровка1</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРасшифровка2</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗаписиРезультата</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИтоговоеСальдо</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолеЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД_Привязки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>32</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

snlkuharlocal/src/Documents/Отчет/ObjectModule.bsl
Функция ЗаполнитьОтчет() Экспорт
	Если ВидОтчета.СпособРасчета="Компоновка" Тогда
		Возврат ЗаполнитьОтчет_Компоновка();
	Иначе
		Возврат ЗаполнитьОтчет_Построитель();
	КонецЕсли; 
КонецФункции

Функция ЗаполнитьОтчет_Компоновка() 
	Результат=Новый Структура("Результат,Описание",Ложь,"");

	СхемаКомпоновки=ВидОтчета.СхемаКомпоновки.Получить();
	
	Если СхемаКомпоновки = Неопределено Тогда
		Результат.Вставить("Описание","Не задана схема компоновки отчета !");
		Возврат Результат;
	КонецЕсли;
	
	ГраницыПериода=ПолучитьГраницыПериода(Дата,Периодичность);
	Дата1=?(СНачалаГода,НачалоГода(ГраницыПериода.Дата1),ГраницыПериода.Дата1);
	
	КН=Новый КомпоновщикНастроекКомпоновкиДанных;	
	КН.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
	КН.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
	
	ЭлементПараметра=КН.Настройки.ПараметрыДанных.Элементы.Найти("Дата1");
	Если ЭлементПараметра<>Неопределено Тогда
		ЭлементПараметра.Значение=Дата1;
		ЭлементПараметра.Использование=Истина;		
	КонецЕсли;
	
	ЭлементПараметра=КН.Настройки.ПараметрыДанных.Элементы.Найти("Дата2");
	Если ЭлементПараметра<>Неопределено Тогда
		ЭлементПараметра.Значение=ГраницыПериода.Дата2;
		ЭлементПараметра.Использование=Истина;		
	КонецЕсли;	
	
	ЭлементПараметра=КН.Настройки.ПараметрыДанных.Элементы.Найти("Подразделение");
	Если ЭлементПараметра<>Неопределено Тогда
		ЭлементПараметра.Значение=?(Подразделение.Пустая(),Неопределено,Подразделение);
		ЭлементПараметра.Использование=Истина;		
	КонецЕсли;
	
	ДанныеРасшифровки	=Неопределено;
	
	КМ	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МК	= КМ.Выполнить(СхемаКомпоновки, КН.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));	
	
	ПК= Новый ПроцессорКомпоновкиДанных;
	ПК.Инициализировать(МК,,,Истина);
	
	ПВ = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТР=Новый ТаблицаЗначений;
	ТР=ПВ.Вывести(ПК,Истина);	
		
	Данные.Очистить();
	
	ВыборкаПоказателей=Справочники.ПоказателиОтчетов.Выбрать(,ВидОтчета);	
	СписокПоказателей=Новый Структура;
	Пока ВыборкаПоказателей.Следующий() Цикл 
		СписокПоказателей.Вставить(ВыборкаПоказателей.ИмяПоляКомпоновки,ВыборкаПоказателей.Ссылка);
	КонецЦикла;
	
	ЕстьРасшифровка1=?(ТР.Колонки.Найти("Расшифровка1")=Неопределено,Ложь,Истина);
	ЕстьРасшифровка2=?(ТР.Колонки.Найти("Расшифровка2")=Неопределено,Ложь,Истина);
	ЕстьРегистр		=?(ТР.Колонки.Найти("Регистр")=Неопределено,Ложь,Истина);
	
	Для Каждого СтрокаТР Из ТР Цикл			
		Для Каждого Показатель Из СписокПоказателей Цикл
			Если ТР.Колонки.Найти(Показатель.Ключ)<>Неопределено Тогда
				Значение=СтрокаТР[Показатель.Ключ];
				Если Значение<>0 Тогда					
					СтрокаДанных=Данные.Добавить();
					
					СтрокаДанных.РазделОтчета	=СтрокаТР.РазделОтчета;
					
					Если ЕстьРасшифровка1 Тогда				
						СтрокаДанных.Расшифровка1=СтрокаТР.Расшифровка1;
					КонецЕсли;
					Если ЕстьРасшифровка2 Тогда				
						СтрокаДанных.Расшифровка2=СтрокаТР.Расшифровка2;
					КонецЕсли;
					Если ЕстьРегистр Тогда
						СтрокаДанных.Регистр=СтрокаТР.Регистр;
					КонецЕсли; 
					
					СтрокаДанных.Показатель  	=Показатель.Значение;
					СтрокаДанных.Значение		=Значение;			
				КонецЕсли; 
			КонецЕсли;		
		КонецЦикла;	
	КонецЦикла;
	
	Результат.Вставить("Результат",Истина);
	Результат.Вставить("ТР",ТР);
	
	ВычислитьРасчетныеСтроки();
	
	Возврат Результат;
КонецФункции

Функция ЗаполнитьОтчет_Построитель()	
    ГраницыПериода=ПолучитьГраницыПериода(Дата,Периодичность);
	
	ИмяФайлаОбработки=СокрЛП(Константы.КаталогВнешнихОтчетов.Получить())+"\РасчетОтчета.epf";
	Файл=Новый Файл(ИмяФайлаОбработки);
	Если Файл.Существует() Тогда
		#ЕСЛИ ВНЕШНЕЕСОЕДИНЕНИЕ ИЛИ СЕРВЕР ТОГДА
		Возврат Ложь;
		#ИНАЧЕ
		Обработка=ВнешниеОбработки.Создать(ИмяФайлаОбработки);
		#КОНЕЦЕСЛИ
	Иначе
		Обработка=Обработки.РасчетОтчета.Создать();		
	КонецЕсли;
	
	Обработка.ВидОтчета		= ВидОтчета;
	Обработка.РазделОтчета  = Неопределено;	
	Обработка.Дата1			=?(СНачалаГода,НачалоГода(ГраницыПериода.Дата1),ГраницыПериода.Дата1);
	Обработка.Дата2			=ГраницыПериода.Дата2;
    //Обработка.Организация	=Организация;
	Обработка.ДокОтчет		=ЭтотОбъект;
	
	Обработка.ВыполнитьРасчет();
	Данные.Очистить();
	Для Каждого СтрокаТР Из Обработка.ТР Цикл
		СтрокаТЧ=Данные.Добавить();
	    ЗаполнитьЗначенияСвойств(СтрокаТЧ,СтрокаТР);	
		СтрокаТЧ.Период=НачалоМесяца(Дата);
	КонецЦикла;	
КонецФункции // ЗаполнитьОтчет()

Функция ПолучитьПоляРасшифровки(ЭлементРасшифровки) Экспорт
	СтруктураОтбора=Новый Структура;	
	
	Если ЭлементРасшифровки = Неопределено Тогда
		Возврат СтруктураОтбора;
	КонецЕсли;
	
	ВыковырятьРекурсивно(ЭлементРасшифровки,СтруктураОтбора);	
	
	Возврат СтруктураОтбора;
КонецФункции //ПолучитьПоляРасшифровки(Область)

Процедура ВыковырятьРекурсивно(ЭлементРасшифровки,СтруктураПолей)	
	Родители=ЭлементРасшифровки.ПолучитьРодителей();
	Для Каждого Родитель Из Родители Цикл
		Если ТипЗнч(Родитель)=Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
			ПоляРодителя=Родитель.ПолучитьПоля();
			Для Каждого Поле Из ПоляРодителя Цикл
				Если Поле.Значение<>Null И НЕ СтруктураПолей.Свойство(Поле.Поле) Тогда
					СтруктураПолей.Вставить(Поле.Поле,Поле.Значение);				
				КонецЕсли;						
			КонецЦикла;				
		КонецЕсли;
		
		ВыковырятьРекурсивно(Родитель,СтруктураПолей);
	КонецЦикла;
	
КонецПроцедуры

Функция РасковырятьТД(ТД,ДанныеРасшифровки) Экспорт
	ТР=Новый ТаблицаЗначений;	
	
	Для Стр=1 По ТД.ВысотаТаблицы Цикл		
		Если ТД.Область(Стр,1).Расшифровка=Неопределено Тогда Продолжить КонецЕсли;			
		
		Для Кол=1 По ТД.ШиринаТаблицы Цикл
			Обл=ТД.Область(Стр,Кол);
			
			Если Обл.Расшифровка<>Неопределено Тогда
				ЭлементРасшифровки=ДанныеРасшифровки.Элементы.Получить(Обл.Расшифровка);
				
				Если ТипЗнч(ЭлементРасшифровки)<>Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда Продолжить КонецЕсли;				
				
				Поля	=ЭлементРасшифровки.ПолучитьПоля();			
				
				Если Поля.Количество()>0 Тогда					
					Поле=Поля[0];				
					Если Поле.Поле<>"Значение" Тогда Продолжить КонецЕсли; 
					
					Если ТР.Колонки.Найти(Поле.Поле)=Неопределено Тогда
						ТР.Колонки.Добавить(Поле.Поле);					
					КонецЕсли;				
					
					Попытка
						ЗначениеПоля=Число(Обл.Текст);
					Исключение
						ЗначениеПоля=0;
					КонецПопытки;
					
					Если ЗначениеПоля=0 Тогда Продолжить КонецЕсли;			
						
					СтрокаТР=ТР.Добавить();
					СтрокаТР[Поле.Поле]=ЗначениеПоля;					
					
					СтруктураРасшифровки=ПолучитьПоляРасшифровки(ЭлементРасшифровки);
					
					Родители=ЭлементРасшифровки.ПолучитьРодителей();
					
					Для Каждого Поле Из СтруктураРасшифровки Цикл
						Если Поле.Значение<>Null Тогда
							Если ТР.Колонки.Найти(Поле.Ключ)=Неопределено Тогда
								ТР.Колонки.Добавить(Поле.Ключ);
							КонецЕсли;						
							СтрокаТР[Поле.Ключ]=Поле.Значение;
						КонецЕсли;
					КонецЦикла;					
				КонецЕсли;
			КонецЕсли;						
		КонецЦикла;	
	КонецЦикла; 
	
	ТР.Колонки.Добавить("НомерСтрокиОтчета");
	Для Каждого СтрокаТР Из ТР Цикл
		Если СтрокаТР.РазделОтчета<>Неопределено Тогда
			СтрокаТР.НомерСтрокиОтчета=СтрокаТР.РазделОтчета.НомерСтрокиОтчета;			
		КонецЕсли;		
	КонецЦикла; 
	
	Возврат ТР;
КонецФункции

Процедура УстановитьПараметрДанныхНастройки(Настройки,ИмяПараметра,ЗначениеПараметра)
	ПД=Настройки.ПараметрыДанных.Элементы.Найти(ИмяПараметра);
	Если ПД<>Неопределено Тогда
		ПД.Значение		=ЗначениеПараметра;	
		ПД.Использование=Истина;
	КонецЕсли;
КонецПроцедуры
 
Функция ПолучитьВыходнуюФорму(СК=Неопределено,Настройки=Неопределено) Экспорт
	Результат=Новый Структура("Результат,ТД,ТР",Ложь,Неопределено,Неопределено);
	
	#ЕСЛИ КЛИЕНТ ТОГДА	
	Если СК = Неопределено Тогда 
		СК=ВидОтчета.СхемаКомпоновкиВывода.Получить();		
	КонецЕсли;
	   
	Если СК = Неопределено Тогда Возврат Результат КонецЕсли;
	
	ВнешниеНаборыДанных = Новый Структура;	
	ВнешниеНаборыДанных.Вставить("Данные", Данные);	
	
	ДанныеРасшифровки	=Неопределено;	
	
	СК.Параметры.ВидОтчета.Значение=ВидОтчета;
	
	ТекНастройки=?(Настройки=Неопределено,СК.НастройкиПоУмолчанию,Настройки);	
	
	УстановитьПараметрДанныхНастройки(ТекНастройки,"ВидОтчета",					ВидОтчета);
	УстановитьПараметрДанныхНастройки(ТекНастройки,"ВалютаВывода",				ВалютаВывода);
	УстановитьПараметрДанныхНастройки(ТекНастройки,"Курс",						Курс);
	УстановитьПараметрДанныхНастройки(ТекНастройки,"Подразделение",				Подразделение);
	УстановитьПараметрДанныхНастройки(ТекНастройки,"ДатаЗапретаРедактирования",	ПолучитьДатуЗапретаРедактирования(Ссылка));
	УстановитьПараметрДанныхНастройки(ТекНастройки,"Дата1",						НачалоДня(Дата1));
	УстановитьПараметрДанныхНастройки(ТекНастройки,"Дата2",						КонецДня(Дата2));	
	
	КМ	= Новый КомпоновщикМакетаКомпоновкиДанных;
	МК	= КМ.Выполнить(СК,ТекНастройки, ДанныеРасшифровки);		
	
	ПК= Новый ПроцессорКомпоновкиДанных;
	ПК.Инициализировать(МК,ВнешниеНаборыДанных,ДанныеРасшифровки);	
	
	ТД=Новый ТабличныйДокумент;
	ВывестиРезультатВТабличныйДокумент(ПК, ТД);
	
	//ТР=РасковырятьТД(ТД,ДанныеРасшифровки);
	
	Результат.Вставить("Результат",Истина);
	Результат.Вставить("ТД",ТД);
	//Результат.Вставить("ТР",ТР);
	Результат.Вставить("ДанныеРасшифровки",ДанныеРасшифровки);
	#КОНЕЦЕСЛИ
	
	Возврат Результат;
	
КонецФункции // ПолучитьВыходнуюФорму() 

//РАСЧЕТ ВЫЧИСЛЯЕМЫХ СТРОК
Функция ПолучитьФактическиеПараметры(СписокФормальныхПараметров,ДанныеРасчета,Показатель,Подразделение=Неопределено,Период=Неопределено,ОбщийИтог=Ложь)
	СписокФактическихПараметров=Новый Соответствие;
	
	Для Каждого ФП Из СписокФормальныхПараметров Цикл
		Значение=0;
		
		Отбор=Новый Структура("НомерСтрокиОтчета,Показатель",ФП.Ключ,Показатель);		
		Если Подразделение<>Неопределено Тогда
			Отбор.Вставить("Подразделение",Подразделение);		
		КонецЕсли;		
		Если НЕ ОбщийИтог И ЗначениеЗаполнено(Период) Тогда
			Отбор.Вставить("Период",Период);
		КонецЕсли;
		Отбор.Вставить("ОбщийИтог",ОбщийИтог);
		
		Если ДанныеРасчета.Количество()>0 Тогда
			СтрокиДанных=ДанныеРасчета.НайтиСтроки(Отбор);		
			Для Каждого СтрокаДанных Из СтрокиДанных Цикл
				Значение=Значение+СтрокаДанных.Значение;
			КонецЦикла;		
		КонецЕсли;
		
		СписокФактическихПараметров.Вставить(ФП.Ключ,Значение);
	КонецЦикла;
	
	Возврат СписокФактическихПараметров;
КонецФункции

Процедура ВычислитьФормулу(РазделОтчета,ТаблицаРасчета,СтрокаТП=Неопределено,ВыводитьОшибки=Ложь)
	Если РасчетФормулПоПодразделению Тогда
		ТекПодразделение=СтрокаТП.Подразделение;
	Иначе
		ТекПодразделение=Неопределено;		
	КонецЕсли; 
	ТекПериод=Дата1;   // нечаеа
	Если СтрокаТП=Неопределено Тогда
		ТекПериод=Дата1;
	Иначе
		ТекПериод=СтрокаТП.Период;	
	КонецЕсли;	
	Если СтрокаТП=Неопределено Тогда
		ОбщийИтог=Ложь;	
	Иначе
		ОбщийИтог=СтрокаТП.ОбщийИтог;	
	КонецЕсли; 
	
	ФормальныеПараметры=ПолучитьФормальныеПараметры(РазделОтчета.ФормулаРасчета);
	Если ФормальныеПараметры.Результат Тогда
		
		ВыборкаПоказателей=Справочники.ПоказателиОтчетов.Выбрать(,РазделОтчета.Владелец);
		Пока ВыборкаПоказателей.Следующий() Цикл
			Показатель=ВыборкаПоказателей.Ссылка;
			
			ФактическиеПараметры=ПолучитьФактическиеПараметры(ФормальныеПараметры.ФормальныеПараметры,ТаблицаРасчета,Показатель,ТекПодразделение,ТекПериод,ОбщийИтог);
			
			Значение=0;
			Попытка					
				Значение=Вычислить(ФормальныеПараметры.ИсполняемаяФормула);
			Исключение
				Если ВыводитьОшибки Тогда
					Сообщить("Ошибка расчета показателя ! Раздел: "+РазделОтчета.Код+" "+РазделОтчета.Наименование+", показатель: "+Показатель+". "+ОписаниеОшибки(),СтатусСообщения.Важное);						
				КонецЕсли;						
			КонецПопытки;
			
			Если Значение<>0 Тогда
				СтрокаДанных=Данные.Добавить();						
				
				СтрокаДанных.РазделОтчета	=РазделОтчета;
				СтрокаДанных.Показатель		=Показатель;				
				
				СтрокаДанных.Подразделение	=ТекПодразделение;
				СтрокаДанных.Период			=ТекПериод;
				СтрокаДанных.ОбщийИтог		=ОбщийИтог;
				
				СтрокаДанных.Значение		=Значение;				
				
				СтрокаТР					=ТаблицаРасчета.Добавить();
				
				СтрокаТР.НомерСтрокиОтчета	=РазделОтчета.НомерСтрокиОтчета;
				СтрокаТР.Показатель			=Показатель;				
				
				СтрокаТР.Подразделение		=ТекПодразделение;
				СтрокаТР.Период				=ТекПериод;
				СтрокаТР.ОбщийИтог			=ОбщийИтог;
				
				СтрокаТР.Значение			=Значение;				
			КонецЕсли;					
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры

Функция ПолучитьТаблицуРасчета()
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.Текст="
	|ВЫБРАТЬ 
	|	*
	|ПОМЕСТИТЬ ИД
	|ИЗ &Данные КАК Данные";
	
	Запрос.УстановитьПараметр("Данные",Данные);
	Запрос.Выполнить();
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	РазделОтчета 					КАК РазделОтчета,
	|	Показатель 						КАК Показатель,	
	|	Период,
	|	РазделОтчета.НомерСтрокиОтчета	КАК НомерСтрокиОтчета,
	|	Значение 						КАК Значение,
	|	ОбщийИтог						
	|ИЗ
	|	ИД	
	|ГДЕ
	//|	НЕ ОбщийИтог	
	//|	И 
	|	НЕ РазделОтчета.Расчетная
	|ИТОГИ
	|	СУММА(Значение)
	|ПО		
	|	Показатель,ОбщийИтог,	
	|	Период ПЕРИОДАМИ(Месяц, &Дата1,&Дата2),	
	|	РазделОтчета ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Дата1",НачалоГода(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецГода(Дата));	
	
	ТР=Новый ТаблицаЗначений;
	ТР.Колонки.Добавить("ОбщийИтог");
	ТР.Колонки.Добавить("Показатель");
	ТР.Колонки.Добавить("Подразделение");
	ТР.Колонки.Добавить("Период");
	ТР.Колонки.Добавить("РазделОтчета");
	ТР.Колонки.Добавить("НомерСтрокиОтчета");
	ТР.Колонки.Добавить("Значение");	
	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.РазделОтчета) И ЗначениеЗаполнено(Выборка.Показатель) И (ЗначениеЗаполнено(Выборка.Период) ИЛИ Выборка.ОбщийИтог) И Выборка.ТипЗаписи()<>ТипЗаписиЗапроса.ДетальнаяЗапись Тогда
			СтрокаТР=ТР.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТР,Выборка);		
		КонецЕсли;	
	КонецЦикла; 
	
	Запрос.Текст="
	|ВЫБРАТЬ
	|	РазделОтчета 					КАК РазделОтчета,
	|	Показатель 						КАК Показатель,		
	|	РазделОтчета.НомерСтрокиОтчета	КАК НомерСтрокиОтчета,
	|	Значение 						КАК Значение
	|ИЗ
	|	ИД	
	|ГДЕ
	|	ОбщийИтог	
	|	И НЕ РазделОтчета.Расчетная
	|ИТОГИ
	|	СУММА(Значение)
	|ПО		
	|	Показатель,	
	|	РазделОтчета ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Дата1",НачалоГода(Дата));
	Запрос.УстановитьПараметр("Дата2",КонецГода(Дата));	
	
	Возврат ТР;
КонецФункции //ПолучитьТаблицуРасчета()
 

Функция ВычислитьРасчетныеСтроки(ВыводитьОшибки=Истина) Экспорт	
	
	РасчетныеСтроки=Новый Массив;
	Для Каждого СтрокаДанных Из Данные Цикл
		Если НЕ СтрокаДанных.РазделОтчета.Пустая() И НЕ СтрокаДанных.РазделОтчета.ЭтоГруппа И СтрокаДанных.РазделОтчета.Расчетная Тогда
			РасчетныеСтроки.Добавить(СтрокаДанных);
		ИначеЕсли СтрокаДанных.ОбщийИтог Тогда
			РасчетныеСтроки.Добавить(СтрокаДанных);			
		КонецЕсли;		
	КонецЦикла;	
	
	Для Каждого РС Из РасчетныеСтроки Цикл
		Данные.Удалить(РС);	
	КонецЦикла; 
	
	Если РасчетФормулПоПериодам Тогда		
		Запрос=Новый Запрос;
		Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
		Запрос.Текст="
		|ВЫБРАТЬ 
		|	*
		|ПОМЕСТИТЬ ИД
		|ИЗ &Данные КАК Данные";
		
		Запрос.УстановитьПараметр("Данные",Данные);
		Запрос.Выполнить();	
		
		Запрос.Текст="
		|ВЫБРАТЬ		
		|	РазделОтчета 							КАК РазделОтчета,
		|	Показатель 								КАК Показатель,
		|	НачалоПериода(Период,"+Периодичность+")	КАК Период,
		|	NULL		 							КАК Подразделение,
		|	Истина									КАК ОбщийИтог,
		|	Расшифровка1,
		|	Расшифровка2,
		|	Расшифровка3,
		|	Регистр,
		|	Привязка,
		|	ЗнакПривязки,	
		|	СУММА(Значение)					КАК Значение
		|ИЗ
		|	ИД	
		|СГРУППИРОВАТЬ ПО
		|	РазделОтчета,
		|	Показатель,	
		|	Период,
		|	Расшифровка1,
		|	Расшифровка2,
		|	Расшифровка3,
		|	Регистр,
		|	Привязка,
		|	ЗнакПривязки";
		
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ=Данные.Добавить();	
			ЗаполнитьЗначенияСвойств(СтрокаТЧ,Выборка);
		КонецЦикла; 
	КонецЕсли;	
	
	ТР=ПолучитьТаблицуРасчета();	
	
	Запрос=Новый Запрос;
	Запрос.МенеджерВременныхТаблиц=Новый МенеджерВременныхТаблиц;
	Запрос.Текст="ВЫБРАТЬ * ПОМЕСТИТЬ ДАННыЕ ИЗ &Данные КАК ИсхДанные";
	Запрос.УстановитьПараметр("Данные",Данные);
	Запрос.Выполнить();
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ Период,ОбщийИтог ИЗ Данные ГДЕ Период МЕЖДУ &Дата1 И &Дата2";	
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Дата1));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Дата2));
	
	ТП=Запрос.Выполнить().Выгрузить();
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ	
	|	Ссылка,
	|	Код,
	|	Наименование,
	|	НомерСтрокиОтчета,
	|	ФормулаРасчета
	|ИЗ
	|	Справочник.АналитикаОтчетов КАК АналитикаОтчетов
	|ГДЕ
	|	Владелец					= &ВидОтчета
	|	И Расчетная
	|УПОРЯДОЧИТЬ ПО
	|	АналитикаОтчетов.ПорядокРасчета,
	|	АналитикаОтчетов.Код";
	
	Запрос.УстановитьПараметр("ВидОтчета",ВидОтчета);
	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.ФормулаРасчета) Тогда
			Если РасчетФормулПоПодразделению ИЛИ РасчетФормулПоПериодам Тогда
				Для Каждого СтрокаТП Из ТП Цикл
					//ВычислитьФормулу(РазделОтчета,ТаблицаРасчета,Подразделение=Неопределено,ВыводитьОшибки=Ложь)
					ВычислитьФормулу(Выборка.Ссылка,ТР,СтрокаТП,ВыводитьОшибки);					
				КонецЦикла;
			Иначе
				ВычислитьФормулу(Выборка.Ссылка,ТР,,ВыводитьОшибки);
			КонецЕсли;						
		КонецЕсли;	
	КонецЦикла;
КонецФункции // ()
 
Процедура ПроверитьУстановитьДатыПериода() Экспорт
	Если ВводОстатков ИЛИ ПланФакт=Перечисления.ПланФакт.Факт Тогда		
		НовДата1=НачалоМесяца(Дата);
		НовДата2=КонецМесяца(Дата);
	Иначе
		НовДата1=НачалоГода(Дата);
		НовДата2=КонецГода(Дата);		
	КонецЕсли;
	Если Дата1<>НовДата1 Тогда
		Дата1=НовДата1;	
	КонецЕсли; 
	Если НачалоДня(Дата2)<>НачалоДня(НовДата2) Тогда
		Дата2=НовДата2;	
	КонецЕсли;
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	
	Если Модифицированность() Тогда
		ПроверитьУстановитьДатыПериода();
	КонецЕсли; 
КонецПроцедуры
